back_end/app/controllers/articles_controller.rb

    def index
        # binding.pry
        articles = Article.all
---
SELECT "articles".* FROM "articles"

    def articles_with_params
                # binding.pry
        articles = Article.where("name LIKE ?", "%#{params.permit(:query)[:query]}%")
---
SELECT "articles".* FROM "articles" WHERE (name LIKE '%find%')