back_end/app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-01-04 21:35:35.528745"], ["updated_at", "2020-01-04 21:35:35.528745"]]
---
    def show
        cart = Cart.find_or_create_by(id: params.permit(:id)[:id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        # binding.pry
        cart = Cart.find_by(id: params.permit(:id)[:id])
        article = Article.find_by(id: params.permit(:article_id)[:article_id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def destroy

        # binding.pry
        cart = Cart.find_by(id: params.permit(:id)[:id])
        article = Article.find_by(id: params.permit(:article_id)[:article_id])